Documents/ЭлектронноеПисьмо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЭлектронноеПисьмо</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IDПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Входящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Email</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПрикрепленныеДанныеЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПрикрепленныеДанныеЭлектронныхПисем</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЭлектронноеПисьмо/Ext/ManagerModule.bsl
Функция ПреобразоватьТекстВHTML(Знач ИсходныйТекст)
	
	Возврат СтрЗаменить(ИсходныйТекст,Символы.ПС,"<br>");
	
КонецФункции

//отправляет указанное электронное письмо
//параметры:
//ссылка - ссылка на документ "Электронное письмо"
//
//возвращаемое значение:
//строка с текстом ошибки отправки. пустая строка, если успешно отправлено
Функция ОтправитьЭлектронноеПисьмо(Ссылка) Экспорт
	
	Если НЕ Ссылка.Входящее Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		//++ №8201 текст ошибок будет накапливаться и сразу меняем в объекте
		ОписаниеОшибки = "";
		ДокументОбъект = Ссылка.ПолучитьОбъект();
		//-- №8201
			
		//Если Не Ссылка.Получатели.Количество() = 0 Тогда
		Для Каждого Строка Из ДокументОбъект.Получатели Цикл //Ссылка.Получатели Цикл
			
			//++ №8201 новый реквизит взводится при успешной отправке, соответственно если уже отправлялось ранее, повторно не отправляем
			Если Строка.Отправлено Тогда
				Продолжить;
			КонецЕсли;
			//-- №8201
			
			ОтправитьЭлектронноеПисьмоПроцесс(Ссылка, Строка.Контрагент, Строка.Email, Строка, ОписаниеОшибки); //++ вывели в отдельную процедуру
				
			//++ №8201 закомментировано, объект меняем после попытки отправки каждому получателю
			//ДокументОбъект = Ссылка.ПолучитьОбъект();
			//ДокументОбъект.Отправлен = Истина;
			//ДокументОбъект.ДатаОтправки = ТекущаяДатаСеанса();
			//ДокументОбъект.Записать();
			//-- №8201
			
			//Возврат ""; ++ №8201 сразу не возвращаем, иначе 2 и более получатель не получат письмо
						
		КонецЦикла;
		
		//++ №8201 Один получатель
		Если ДокументОбъект.Получатели.Количество() = 0 Тогда
			ОтправитьЭлектронноеПисьмоПроцесс(Ссылка, ДокументОбъект.Контрагент, ДокументОбъект.АдресПолучателя, Неопределено, ОписаниеОшибки);
			Если НЕ ЗначениеЗаполнено(ОписаниеОшибки) Тогда
				ДокументОбъект.Отправлен = Истина;
				ДокументОбъект.ДатаОтправки = ТекущаяДатаСеанса();
			КонецЕсли;	
		КонецЕсли;
		//-- №8201
		
		//++ №8201
		Попытка
			ДокументОбъект.Записать();
		Исключение
			ТекстОшибки = "Не удалось записать документ: " + ОписаниеОшибки();
			ОписаниеОшибки = ОписаниеОшибки + ?(ЗначениеЗаполнено(ОписаниеОшибки), Символы.ПС, "") + ТекстОшибки;
		КонецПопытки;
		
		Возврат ОписаниеОшибки;
		//-- №8201
		
		
		//++ №8201 закомментировано, т.к. сейчас в любом случае будут данные в ТЧ, даже если галочка "Несколько получаетелей" не установлена
		//		и плюс дублирование кода
		//Иначе
		//	Попытка
		//		Почта = новый ИнтернетПочта;
		//		Почта.Подключиться(Справочники.УчетныеЗаписиЭлектроннойПочты.ПолучитьИнтернетПочтовыйПрофиль(Ссылка.Отправитель));
		//		
		//		Сообщение = Новый ИнтернетПочтовоеСообщение;
		//		Сообщение.Отправитель.Адрес = Ссылка.Отправитель.АдресЭлектроннойПочты;
		//		Сообщение.Получатели.Добавить(Ссылка.АдресПолучателя);
		//		Сообщение.Тема = Ссылка.Заголовок;
		//		ТекстПисьма = ?(НЕ ПустаяСтрока(Ссылка.ТекстHTML), Ссылка.ТекстHTML, ПреобразоватьТекстВHTML(Ссылка.ТекстПисьма));
		//		Текст = Сообщение.Тексты.Добавить(ТекстПисьма);
		//		Текст.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
		//		
		//		//получаем и прикрепляем вложения
		//		Запрос = Новый Запрос;
		//		Запрос.Текст = 
		//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//		|	ПрикрепленныеДанныеЭлектронныхПисем.Период,
		//		|	ПрикрепленныеДанныеЭлектронныхПисем.СсылкаНаОбъект,
		//		|	ПрикрепленныеДанныеЭлектронныхПисем.ИмяФайла,
		//		|	ПрикрепленныеДанныеЭлектронныхПисем.Данные,
		//		|	ПрикрепленныеДанныеЭлектронныхПисем.Расширение
		//		|ИЗ
		//		|	РегистрСведений.ПрикрепленныеДанныеЭлектронныхПисем КАК ПрикрепленныеДанныеЭлектронныхПисем
		//		|ГДЕ
		//		|	ПрикрепленныеДанныеЭлектронныхПисем.СсылкаНаОбъект = &СсылкаНаОбъект";
		//		Запрос.УстановитьПараметр("СсылкаНаОбъект",Ссылка);
		//		Выборка = Запрос.Выполнить().Выбрать();
		//		Пока Выборка.Следующий() Цикл
		//			Данные = Выборка.Данные.Получить();
		//			Вложение = Сообщение.Вложения.Добавить(Данные, СокрЛП(Выборка.ИмяФайла) + СокрЛП(Выборка.Расширение));
		//		КонецЦикла;
		//		
		//		
		//		Почта.Послать(Сообщение);
		//		Почта.Отключиться();
		//		
		//		ДокументОбъект = Ссылка.ПолучитьОбъект();
		//		ДокументОбъект.Отправлен = Истина;
		//		ДокументОбъект.ДатаОтправки = ТекущаяДатаСеанса();
		//		ДокументОбъект.Записать();
		//		Возврат "";
		//	Исключение
		//		Возврат "Ошибка отправки письма: " + ОписаниеОшибки();
		//	КонецПопытки;
		//КонецЕсли;
		//-- №8201
	КонецЕсли;
	
КонецФункции

Процедура ОтправитьЭлектронноеПисьмоПроцесс(Ссылка, Контрагент, Email, Строка = Неопределено, ОписаниеОшибки)
	
	Попытка
		
		Почта = новый ИнтернетПочта;
		Почта.Подключиться(Справочники.УчетныеЗаписиЭлектроннойПочты.ПолучитьИнтернетПочтовыйПрофиль(Ссылка.Отправитель));
		
		Сообщение = Новый ИнтернетПочтовоеСообщение;
		Сообщение.Отправитель.Адрес = Ссылка.Отправитель.АдресЭлектроннойПочты;
		Сообщение.Получатели.Добавить(Email);
		Сообщение.Тема = Ссылка.Заголовок;
		ТекстПисьма = ?(НЕ ПустаяСтрока(Ссылка.ТекстHTML), Ссылка.ТекстHTML, ПреобразоватьТекстВHTML(Ссылка.ТекстПисьма));
		Текст = Сообщение.Тексты.Добавить(ТекстПисьма);
		Текст.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
		
		//получаем и прикрепляем вложения
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрикрепленныеДанныеЭлектронныхПисем.Период,
		|	ПрикрепленныеДанныеЭлектронныхПисем.СсылкаНаОбъект,
		|	ПрикрепленныеДанныеЭлектронныхПисем.ИмяФайла,
		|	ПрикрепленныеДанныеЭлектронныхПисем.Данные,
		|	ПрикрепленныеДанныеЭлектронныхПисем.Расширение
		|ИЗ
		|	РегистрСведений.ПрикрепленныеДанныеЭлектронныхПисем КАК ПрикрепленныеДанныеЭлектронныхПисем
		|ГДЕ
		|	ПрикрепленныеДанныеЭлектронныхПисем.СсылкаНаОбъект = &СсылкаНаОбъект";
		Запрос.УстановитьПараметр("СсылкаНаОбъект",Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Данные = Выборка.Данные.Получить();
			Вложение = Сообщение.Вложения.Добавить(Данные, СокрЛП(Выборка.ИмяФайла) + СокрЛП(Выборка.Расширение));
		КонецЦикла;
		
		
		Почта.Послать(Сообщение);
		Почта.Отключиться();
		
		//++ №8201 добавлены новые реквизиты в ТЧ, сразу меняем в объекте
		Если НЕ Строка = Неопределено Тогда
			Строка.Отправлено = Истина;
			Строка.ДатаОтправки = ТекущаяДатаСеанса();
		КонецЕсли;	
		//-- №8201
		
	Исключение
		
		//++ №8201 ошибку запомним, сразу не возвращаем
		//Возврат "Ошибка отправки письма контрагенту " + Строка.Контрагент + ": " + ОписаниеОшибки();
		ТекстОшибки = СтрШаблон("Ошибка отправки письма %1: %2", ?(ЗначениеЗаполнено(Контрагент), "контрагенту " + Контрагент, ""), ОписаниеОшибки());
		ОписаниеОшибки = ОписаниеОшибки + ?(ЗначениеЗаполнено(ОписаниеОшибки), Символы.ПС, "") + ТекстОшибки;
		
	КонецПопытки;
		
КонецПроцедуры
